# DATA100 - Final Project: Storytelling with Data

<hr>
<hr>

## Group 3 Members 
* Argonza, Antoinette Joy 
* Jamia, Gillian Nicole 
* Magsano, Niño Matthew 
* Reyes, Anton Gabriel

<hr>
<hr>

## Motivation

*As Lasallian students, we would want to determine the possible causes of child mortality and provide credible, consolidated information and insights that help prevent or solve this pressing social issue.*

<hr>
<hr>

## Libraries, Packages, or Modules

In [2]:
import os 
import csv
import time
import numpy as np
import pandas as pd
import seaborn as sns
import requests 
import datetime as dt
import geopandas as gpd
import matplotlib.pyplot as plt

from shapely.geometry import Point
from IPython.core.display import HTML

%matplotlib inline
%pylab inline

Populating the interactive namespace from numpy and matplotlib

In [3]:
plt.style.use('seaborn-whitegrid')

<hr>
<hr>

## Data Collection

### Datasets

(To be removed) The dataset for **Mortality among children** can be found here: [`Kaggle` Dataset Source](https://www.kaggle.com/mpwolke/cusersmarildownloadsdeathscsv) <br>
(To be removed) The dataset for **WHO - Immunization coverage estimates by country** can be found here: [`Kaggle` Dataset Source](https://www.kaggle.com/lsind18/who-immunization-coverage) <br>
The dataset for **Malnutrition across the globe** can be found here: [`Kaggle` Dataset Source](https://www.kaggle.com/ruchi798/malnutrition-across-the-globe) <br>
(To be removed) The dataset for **Child Health Dataset** can be found here: [`Kaggle` Dataset Source](https://www.kaggle.com/hijest/child-health-dataset-who) <br>
(To be removed) The dataset for **Out of School Rates Global Data** can be found here: [`Kaggle` Dataset Source](https://www.kaggle.com/komalkhetlani/out-of-school-rates-global-data?select=Primary.csv) <br>
(To be decided on) The dataset for **World Health Statistics 2020** can be found here: [`Kaggle` Dataset Source](https://www.kaggle.com/utkarshxy/who-worldhealth-statistics-2020-complete?select=adolescentBirthRate.csv) <br>

<hr>
<hr>

## Data Wrangling & Exploratory Data Analysis

<hr>

### Mortality among children

In [4]:
mortality = pd.read_csv('mortality_children.csv', delimiter=';')
mortality.drop(['Unnamed: 1', 'Unnamed: 2'], axis=1, inplace=True)
mortality.head(2)

                    region     median      upper   lower  median.1  upper.1
0       Sub-Saharan Africa  39,820157  42,396932  568662    591774   626820
1  West and Central Africa  40,214721  44,137154  262349    279006   303798

In [5]:
mortality.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 348 entries, 0 to 347
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   region    348 non-null    object
 1   median    348 non-null    object
 2   upper     348 non-null    object
 3   lower     348 non-null    int64
 4   median.1  348 non-null    int64
 5   upper.1   348 non-null    int64
dtypes: int64(3), object(3)
memory usage: 16.4+ KB

In [6]:
mortality.describe()

              lower      median.1       upper.1
count  3.480000e+02  3.480000e+02  3.480000e+02
mean   2.581479e+05  2.693984e+05  2.858912e+05
std    3.618285e+05  3.713697e+05  3.867885e+05
min    4.043000e+03  4.173000e+03  4.337000e+03
25%    2.852650e+04  2.955600e+04  3.077225e+04
50%    7.565650e+04  8.906800e+04  1.119010e+05
75%    2.985790e+05  3.262318e+05  3.560085e+05
max    1.678924e+06  1.718785e+06  1.783894e+06

In [7]:
mortality.describe(include=object)

                    region     median      upper
count                  348        348        348
unique                  12        348        348
top     Sub-Saharan Africa  39,820157  42,396932
freq                    29          1          1

In [8]:
mortality.isnull().sum()

region      0
median      0
upper       0
lower       0
median.1    0
upper.1     0
dtype: int64

In [9]:
mortality.duplicated().sum()

0

<hr>

### WHO - Immunization coverage estimates by country

In [10]:
rotac = pd.read_csv('Immunization/ROTAC.csv')
rotac.head(2)

,Country,2020,2019,2018,2017,2016,2015,2014,2013,2012,2011,2010,2009,2008,2007,2006
0,Afghanistan,62.0,58.0,45.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Angola,39.0,58.0,48.0,43.0,44.0,40.0,18.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
rotac.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 108 entries, 0 to 107
Data columns (total 16 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  108 non-null    object
 1    2020    93 non-null     float64
 2    2019    101 non-null    float64
 3    2018    99 non-null     float64
 4    2017    93 non-null     float64
 5    2016    85 non-null     float64
 6    2015    78 non-null     float64
 7    2014    67 non-null     float64
 8    2013    45 non-null     float64
 9    2012    38 non-null     float64
 10   2011    27 non-null     float64
 11   2010    26 non-null     float64
 12   2009    20 non-null     float64
 13   2008    12 non-null     float64
 14   2007    5 non-null      float64
 15   2006    4 non-null      float64
dtypes: float64(15), object(1)
memory usage: 13.6+ KB

In [12]:
rotac.describe()

,2020,2019,2018,2017,2016,2015,2014,2013,2012,2011,2010,2009,2008,2007,2006
count,93.000000,101.000000,99.000000,93.000000,85.000000,78.000000,67.000000,45.000000,38.000000,27.000000,26.000000,20.000000,12.000000,5.000000,4.00000
mean,76.333333,78.732673,78.262626,77.516129,77.529412,76.076923,68.402985,75.200000,71.236842,79.111111,68.846154,67.100000,61.416667,63.800000,41.75000
std,18.485208,20.608683,21.138796,23.223682,21.260621,21.740960,28.096187,23.385699,27.979176,18.690461,24.235003,24.106998,24.857625,20.523158,30.30264
min,0.000000,0.000000,0.000000,3.000000,4.000000,2.000000,1.000000,7.000000,5.000000,27.000000,2.000000,15.000000,3.000000,29.000000,13.00000
25%,70.000000,71.000000,70.000000,70.000000,68.000000,62.500000,51.000000,69.000000,60.250000,69.000000,56.750000,54.750000,48.500000,66.000000,22.00000
50%,82.000000,86.000000,85.000000,85.000000,85.000000,85.000000,83.000000,84.000000,85.000000,85.000000,74.500000,73.500000,62.500000,66.000000,36.00000
75%,89.000000,92.000000,92.500000,93.000000,93.000000,91.000000,90.500000,89.000000,90.750000,92.000000,88.500000,86.000000,81.250000,78.000000,55.75000
max,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,98.000000,98.000000,97.000000,89.000000,80.000000,82.00000

In [13]:
rotac.describe(include=object)

            Country
count           108
unique          108
top     Afghanistan
freq              1

In [43]:
new_rotac = rotac.dropna(axis=1) ############### CONCERN so dropping even the observations or columns with null will not be suggestable? So determining the right year nalang siguro?
new_rotac

                                Country
0                           Afghanistan
1                                Angola
2                             Argentina
3                               Armenia
4                             Australia
..                                  ...
103                          Uzbekistan
104  Venezuela (Bolivarian Republic of)
105                               Yemen
106                              Zambia
107                            Zimbabwe

[108 rows x 1 columns]

In [15]:
new_rotac.isnull().sum() ############################## NOT YET FINAL

Country    0
 2020      0
 2019      0
 2018      0
 2017      0
 2016      0
 2015      0
 2014      0
 2013      0
 2012      0
 2011      0
 2010      0
 2009      0
 2008      0
 2007      0
 2006      0
dtype: int64

In [16]:
new_rotac.duplicated().sum()

0

<hr>

### Malnutrition across the globe

In [17]:
malnutrition = pd.read_csv('malnutrition_country_avg.csv')
malnutrition.head(2)

,Country,Income Classification,Severe Wasting,Wasting,Overweight,Stunting,Underweight,U5 Population ('000s)
0,AFGHANISTAN,0.0,3.033333,10.35,5.125,47.775,30.375,4918.5615
1,ALBANIA,2.0,4.075000,7.76,20.800,24.160,7.700,232.8598

In [18]:
malnutrition.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 152 entries, 0 to 151
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Country                152 non-null    object
 1   Income Classification  152 non-null    float64
 2   Severe Wasting         140 non-null    float64
 3   Wasting                150 non-null    float64
 4   Overweight             149 non-null    float64
 5   Stunting               151 non-null    float64
 6   Underweight            150 non-null    float64
 7   U5 Population ('000s)  152 non-null    float64
dtypes: float64(7), object(1)
memory usage: 9.6+ KB

In [19]:
malnutrition.describe()

,Income Classification,Severe Wasting,Wasting,Overweight,Stunting,Underweight,U5 Population ('000s)
count,152.000000,140.000000,150.000000,149.000000,151.000000,150.000000,152.000000
mean,1.427632,2.168650,6.599257,7.201638,25.814728,13.503047,4042.927052
std,0.967019,1.708939,4.481723,4.649144,14.686807,10.895839,13164.191927
min,0.000000,0.000000,0.000000,0.962500,1.000000,0.100000,1.000000
25%,1.000000,0.900000,3.262500,3.850000,13.485000,4.305000,241.765813
50%,1.000000,1.872500,5.710714,6.300000,24.160000,10.380000,981.233486
75%,2.000000,2.822727,8.740476,9.080000,36.564935,19.496875,3002.433080
max,3.000000,11.400000,23.650000,26.500000,57.600000,46.266667,123014.491000

In [20]:
malnutrition.describe(include=object)

            Country
count           152
unique          152
top     AFGHANISTAN
freq              1

In [21]:
malnutrition.isnull().sum()

Country                   0
Income Classification     0
Severe Wasting           12
Wasting                   2
Overweight                3
Stunting                  1
Underweight               2
U5 Population ('000s)     0
dtype: int64

In [22]:
malnutrition.duplicated().sum()

0

<hr>

### Child Health Dataset

In [23]:
bfd = pd.read_csv('Breastfeeding.csv', encoding='latin1')
bfd.head(2)

,Country,Year,Early initiation of breastfeeding (%),Infants exclusively breastfed for the first six months of life (%),Low-birth-weight newborns (%)
0,Afghanistan,2015-2016,40.9,NaN,NaN
1,Afghanistan,2015,NaN,43.1,NaN

In [24]:
bfd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 785 entries, 0 to 784
Data columns (total 5 columns):
 #   Column                                                              Non-Null Count  Dtype
---  ------                                                              --------------  -----
 0   Country                                                             785 non-null    object
 1   Year                                                                785 non-null    object
 2   Early initiation of breastfeeding (%)                               400 non-null    float64
 3   Infants exclusively breastfed for the first six months of life (%)  530 non-null    float64
 4   Low-birth-weight newborns (%)                                       215 non-null    float64
dtypes: float64(3), object(2)
memory usage: 30.8+ KB

In [25]:
bfd.describe()

,Early initiation of breastfeeding (%),Infants exclusively breastfed for the first six months of life (%),Low-birth-weight newborns (%)
count,400.000000,530.000000,215.000000
mean,47.605250,31.698113,10.404651
std,18.300769,20.501557,5.814016
min,6.000000,0.000000,0.000000
25%,33.700000,14.050000,6.000000
50%,48.050000,29.550000,9.000000
75%,60.500000,46.800000,12.000000
max,94.500000,88.400000,34.000000

In [26]:
bfd.describe(include=object)

       Country   Year
count      785    785
unique     188     56
top       Peru   2000
freq        16     66

In [27]:
bfd.isnull().sum()

Country                                                                 0
Year                                                                    0
Early initiation of breastfeeding (%)                                 385
Infants exclusively breastfed for the first six months of life (%)    255
Low-birth-weight newborns (%)                                         570
dtype: int64

In [28]:
bfd.duplicated().sum()

0

<hr>

### Out of School Rates Global Data

In [29]:
outofschool = pd.read_csv('Primary_out_of_school_rates.csv', encoding='latin1')
outofschool.head(2)

,ISO3,Countries and areas,Region,Sub-region,Development Regions,Total,Female,Male,Rural_Residence,Urban_Residence,Poorest_Wealth quintile,Second_Wealth quintile,Middle_Wealth quintile,Fourth_Wealth quintile,Richest_Wealth quintile,Data source,Time period
0,AFG,Afghanistan,SA,SA,Least Developed,37.0,47.0,28.0,42.0,19.0,42.0,47.0,46.0,32.0,16.0,DHS 2015,2015.0
1,ALB,Albania,ECA,EECA,More Developed,2.0,2.0,3.0,4.0,1.0,4.0,3.0,2.0,2.0,1.0,DHS 2017-18,2018.0

In [30]:
outofschool.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 202 entries, 0 to 201
Data columns (total 17 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   ISO3                     202 non-null    object
 1   Countries and areas      202 non-null    object
 2   Region                   200 non-null    object
 3   Sub-region               200 non-null    object
 4   Development Regions      202 non-null    object
 5   Total                    112 non-null    float64
 6   Female                   112 non-null    float64
 7   Male                     112 non-null    float64
 8   Rural_Residence          109 non-null    float64
 9   Urban_Residence          109 non-null    float64
 10  Poorest_Wealth quintile  103 non-null    float64
 11  Second_Wealth quintile   103 non-null    float64
 12  Middle_Wealth quintile   103 non-null    float64
 13  Fourth_Wealth quintile   103 non-null    float64
 14  Richest_Wealth quintile  103 non-null    float64
 15  Data source              112 non-null    object
 16  Time period              112 non-null    float64
dtypes: float64(11), object(6)
memory usage: 27.0+ KB

In [31]:
outofschool.describe()

,Total,Female,Male,Rural_Residence,Urban_Residence,Poorest_Wealth quintile,Second_Wealth quintile,Middle_Wealth quintile,Fourth_Wealth quintile,Richest_Wealth quintile,Time period
count,112.000000,112.000000,112.000000,109.000000,109.000000,103.000000,103.000000,103.000000,103.000000,103.000000,112.000000
mean,10.160714,10.357143,10.017857,12.321101,5.889908,17.650485,13.000000,9.932039,7.281553,3.864078,2015.455357
std,13.637226,14.520478,12.971891,16.380250,7.763089,20.584931,17.414778,14.955661,11.614239,6.082841,2.581599
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,2010.000000
25%,1.750000,2.000000,2.000000,2.000000,1.000000,2.000000,2.000000,1.000000,1.000000,1.000000,2013.750000
50%,4.000000,3.000000,4.000000,5.000000,3.000000,8.000000,4.000000,3.000000,3.000000,2.000000,2016.000000
75%,15.250000,14.250000,15.000000,19.000000,7.000000,32.000000,21.000000,14.000000,6.500000,4.000000,2018.000000
max,72.000000,75.000000,70.000000,78.000000,56.000000,86.000000,84.000000,77.000000,65.000000,44.000000,2019.000000

In [32]:
outofschool.describe(include=object)

,ISO3,Countries and areas,Region,Sub-region,Development Regions,Data source
count,202,202,200,200,202,112
unique,202,202,6,8,4,42
top,AFG,Afghanistan,ECA,LAC,Less Developed,MICS 2014
freq,1,1,54,37,99,10

In [44]:
outofschool.isnull().sum()

ISO3                        0
Countries and areas         0
Region                      2
Sub-region                  2
Development Regions         0
Total                      90
Female                     90
Male                       90
Rural_Residence            93
Urban_Residence            93
Poorest_Wealth quintile    99
Second_Wealth quintile     99
Middle_Wealth quintile     99
Fourth_Wealth quintile     99
Richest_Wealth quintile    99
Data source                90
Time period                90
dtype: int64

In [45]:
outofschool.duplicated().sum()

0

<hr>

### World Health Statistics 2020

In [35]:
adolescentBR = pd.read_csv('adolescentBirthRate.csv')
adolescentBR.head(2)

,Location,Period,Indicator,First Tooltip
0,Afghanistan,2017,Adolescent birth rate (per 1000 women aged 15-...,62.0
1,Afghanistan,2014,Adolescent birth rate (per 1000 women aged 15-...,77.2

In [36]:
adolescentBR.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2189 entries, 0 to 2188
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Location       2189 non-null   object
 1   Period         2189 non-null   int64
 2   Indicator      2189 non-null   object
 3   First Tooltip  2189 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 68.5+ KB

In [37]:
adolescentBR.describe()

            Period  First Tooltip
count  2189.000000    2189.000000
mean   2008.203289      43.437506
std       5.233686      40.964061
min    2000.000000       0.000000
25%    2004.000000      12.900000
50%    2008.000000      28.200000
75%    2013.000000      62.700000
max    2018.000000     229.000000

In [38]:
adolescentBR.describe(include=object)

          Location                                          Indicator
count         2189                                               2189
unique         195                                                  1
top     Kazakhstan  Adolescent birth rate (per 1000 women aged 15-...
freq            19                                               2189

In [39]:
adolescentBR.isnull().sum()

Location         0
Period           0
Indicator        0
First Tooltip    0
dtype: int64

In [40]:
adolescentBR.duplicated().sum()

0

<hr>
<hr>

## Data Visualization